{
  "pregnancy_emotional_support": {
    "anxious": [
      "It's completely natural to feel scared and uncertain about the journey ahead. Becoming a parent is one of the biggest changes you'll ever experience, and it's okay to worry about whether you'll be a great mom or how the rest of your pregnancy will go. These feelings are actually a sign of just how much you care about your baby and the kind of parent you want to be.",
      "I understand that pregnancy can bring up so many worries and 'what if' thoughts. Your anxiety shows how much you already love this baby. Many expecting mothers feel this way, and it doesn't mean anything is wrong with you - it means you care deeply.",
      "Feeling anxious during pregnancy is incredibly common. There's so much unknown, so many changes happening, and it's natural for your mind to worry. You're not alone in this, and these feelings will ease as you get more information and support."
    ],
    "scared": [
      "Your fears about pregnancy and motherhood are completely valid. It's natural to feel scared when facing something so life-changing and important. These feelings don't mean anything is wrong - they show how much you care.",
      "Being scared about becoming a mother is one of the most normal feelings in the world. You're about to take on one of the most important roles there is, and fear shows you understand the magnitude of that. You're going to be amazing.",
      "Fear during pregnancy often comes from love - fear of not being good enough, fear of something happening to your baby, fear of the unknown. These fears are signs of how much you already love your child."
    ],
    "overwhelmed": [
      "Feeling overwhelmed during pregnancy is so common and understandable. There's so much information, so many changes happening to your body, and so many decisions to make. Take it one day at a time.",
      "I can hear that you're feeling like there's too much to handle right now. Pregnancy can feel overwhelming with all the appointments, decisions, and physical changes. It's okay to take breaks and ask for help.",
      "Being overwhelmed is a normal response to pregnancy. Your body is doing incredible work, your life is changing, and there's a lot to process. Be gentle with yourself and remember you don't have to figure everything out at once."
    ],
    "sad": [
      "I'm sorry you're feeling sad right now. Pregnancy emotions can be intense and sometimes confusing. Your feelings are valid, and it's important to be gentle with yourself during this time.",
      "Sadness during pregnancy is more common than people talk about. Hormones, life changes, and fears can all contribute to feeling down. You're not alone, and these feelings don't reflect on what kind of mother you'll be.",
      "It's okay to feel sad sometimes during pregnancy. This is a huge life change, and it's normal to grieve the life you're leaving behind while also being excited for what's coming. Both feelings can exist together."
    ],
    "excited": [
      "I love hearing the excitement in your words! Pregnancy can be such a magical time, and it's wonderful that you're feeling joy about this journey. Your baby is lucky to have a mom who's so enthusiastic about meeting them.",
      "Your excitement is beautiful and contagious! It's amazing how pregnancy can fill us with such anticipation and wonder. Enjoy these moments of pure joy - they're special.",
      "What a beautiful feeling to be excited about your pregnancy! This enthusiasm will carry you through the challenging moments and shows what a loving parent you're already becoming."
    ],
    "tired": [
      "Pregnancy exhaustion is real and intense. Your body is doing the incredible work of growing a human being, so it makes complete sense that you're feeling tired. Rest when you can, and don't feel guilty about it.",
      "The tiredness you're feeling is your body's way of telling you to slow down and focus on the amazing work it's doing. Listen to those signals and rest as much as possible.",
      "Feeling tired during pregnancy isn't just normal - it's necessary. Your body is using so much energy to create life. Be kind to yourself and rest whenever you can."
    ]
  },
  "general_support": [
    "I'm here to support you through whatever you're feeling. Your emotions and concerns are completely valid.",
    "Whatever you're going through right now, please know that you're not alone. I'm here to listen and support you.",
    "Your feelings matter, and I want you to know that it's okay to feel whatever you're feeling right now.",
    "Thank you for sharing with me. I'm here to support you through this journey in whatever way I can."
  ],
  "validation_responses": [
    "What you're feeling is completely normal and valid.",
    "Many women experience exactly what you're describing.",
    "You're not alone in feeling this way.",
    "Your emotions make perfect sense given what you're going through.",
    "It's okay to have these feelings - they don't define you as a mother."
  ],
  "encouragement": [
    "You're stronger than you know, and you're going to be an amazing mother.",
    "Trust yourself - you already have everything you need to be a great mom.",
    "Every day, you're growing not just a baby, but also growing into the mother you're meant to be.",
    "You're already showing so much love and care for your baby just by being thoughtful about this journey.",
    "Remember, there's no such thing as a perfect mother, only a real one - and that's exactly what your baby needs."
  ]
}